{"format": "graph-model", "generatedBy": "2.8.0", "convertedBy": "TensorFlow.js Converter v3.13.0", "signature": {"outputs": {"node_regression_stride_16_add": {"name": "node_regression_stride_16_add"}, "s64_softmax": {"name": "s64_softmax"}, "s32_softmax": {"name": "s32_softmax"}, "s16_softmax": {"name": "s16_softmax"}, "node_regression_stride_64_add": {"name": "node_regression_stride_64_add"}, "node_regression_stride_32_add": {"name": "node_regression_stride_32_add"}}}, "modelTopology": {"node": [{"name": "node_280_df", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "node_280_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "node_regression_stride_16_weight", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "node_regression_stride_16_bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}}}, {"name": "node_287_df", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "node_287_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "node_regression_stride_32_weight", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "8"}]}}}}}, {"name": "node_regression_stride_32_bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}}}, {"name": "node_regression_stride_64_weight", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "node_regression_stride_64_bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}}}, {"name": "node_283_df", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "node_283_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "node_285_weight", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "4"}]}}}}}, {"name": "node_285_bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "s16_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "node_290_df", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}}}, {"name": "node_290_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "node_292_weight", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "node_292_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "s32_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "data", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"unknownRank": true}}}}, {"name": "mean_value", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "pad0/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "node_199_weight", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "node_199_bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "node_202_df", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "1"}]}}}}}, {"name": "node_202_bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "node_205_weight", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "node_205_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "pad3/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "node_208_df", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "node_208_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "node_211_weight", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "node_211_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "node_214_df", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}}}, {"name": "node_214_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "node_217_weight", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "node_217_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "pad7/paddings", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}}}, {"name": "node_220_df", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}}}, {"name": "node_220_bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "node_223_weight", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "64"}]}}}}}, {"name": "node_223_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "node_226_df", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}}}, {"name": "node_226_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "node_229_weight", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "node_229_bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "node_232_df", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "node_232_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "node_235_weight", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "node_235_bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "node_238_df", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}}}, {"name": "node_238_bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "node_241_weight", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "node_241_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "pad15/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "node_244_df", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "node_244_bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "node_247_weight", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "128"}]}}}}}, {"name": "node_247_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "node_250_df", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}}}, {"name": "node_250_bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "node_253_weight", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "node_253_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "node_256_df", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}}}, {"name": "node_256_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "node_259_weight", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "node_259_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "pad21/paddings", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}}}, {"name": "node_262_df", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}}}, {"name": "node_262_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "node_265_weight", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "256"}]}}}}}, {"name": "node_265_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "node_268_df", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "node_268_bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "node_271_weight", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "node_271_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "node_274_weight", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "64"}]}}}}}, {"name": "node_274_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "pad26/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "node_276_df", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}}}, {"name": "node_276_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "node_278_weight", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "node_278_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "node_295_weight", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "12"}]}}}}}, {"name": "node_295_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "s64_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "mean_shift", "op": "Add", "input": ["data", "mean_value"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pad0", "op": "Pad", "input": ["mean_shift", "pad0/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "node_199", "op": "Conv2D", "input": ["pad0", "node_199_weight"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}}}, {"name": "node_199_add", "op": "Add", "input": ["node_199", "node_199_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_201", "op": "Relu", "input": ["node_199_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "depthwise", "op": "DepthwiseConv2dNative", "input": ["node_201", "node_202_df"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "node_202_add", "op": "Add", "input": ["depthwise", "node_202_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_204", "op": "Relu", "input": ["node_202_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_205", "op": "Conv2D", "input": ["node_204", "node_205_weight"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}}}, {"name": "node_205_add", "op": "Add", "input": ["node_205", "node_205_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_207", "op": "Relu", "input": ["node_205_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pad3", "op": "Pad", "input": ["node_207", "pad3/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "depthwise_1", "op": "DepthwiseConv2dNative", "input": ["pad3", "node_208_df"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "node_208_add", "op": "Add", "input": ["depthwise_1", "node_208_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_210", "op": "Relu", "input": ["node_208_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_211", "op": "Conv2D", "input": ["node_210", "node_211_weight"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}}}, {"name": "node_211_add", "op": "Add", "input": ["node_211", "node_211_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_213", "op": "Relu", "input": ["node_211_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "depthwise_2", "op": "DepthwiseConv2dNative", "input": ["node_213", "node_214_df"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "node_214_add", "op": "Add", "input": ["depthwise_2", "node_214_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_216", "op": "Relu", "input": ["node_214_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_217", "op": "Conv2D", "input": ["node_216", "node_217_weight"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "node_217_add", "op": "Add", "input": ["node_217", "node_217_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_219", "op": "Relu", "input": ["node_217_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pad7", "op": "Pad", "input": ["node_219", "pad7/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "depthwise_3", "op": "DepthwiseConv2dNative", "input": ["pad7", "node_220_df"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}}}, {"name": "node_220_add", "op": "Add", "input": ["depthwise_3", "node_220_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_222", "op": "Relu", "input": ["node_220_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_223", "op": "Conv2D", "input": ["node_222", "node_223_weight"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "node_223_add", "op": "Add", "input": ["node_223", "node_223_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_225", "op": "Relu", "input": ["node_223_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "depthwise_4", "op": "DepthwiseConv2dNative", "input": ["node_225", "node_226_df"], "attr": {"padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "node_226_add", "op": "Add", "input": ["depthwise_4", "node_226_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_228", "op": "Relu", "input": ["node_226_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_229", "op": "Conv2D", "input": ["node_228", "node_229_weight"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}}}, {"name": "node_229_add", "op": "Add", "input": ["node_229", "node_229_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_231", "op": "Relu", "input": ["node_229_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "depthwise_5", "op": "DepthwiseConv2dNative", "input": ["node_231", "node_232_df"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "node_232_add", "op": "Add", "input": ["depthwise_5", "node_232_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_234", "op": "Relu", "input": ["node_232_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_235", "op": "Conv2D", "input": ["node_234", "node_235_weight"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}}}, {"name": "node_235_add", "op": "Add", "input": ["node_235", "node_235_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_237", "op": "Relu", "input": ["node_235_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "depthwise_6", "op": "DepthwiseConv2dNative", "input": ["node_237", "node_238_df"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "node_238_add", "op": "Add", "input": ["depthwise_6", "node_238_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_240", "op": "Relu", "input": ["node_238_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_241", "op": "Conv2D", "input": ["node_240", "node_241_weight"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "node_241_add", "op": "Add", "input": ["node_241", "node_241_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_243", "op": "Relu", "input": ["node_241_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pad15", "op": "Pad", "input": ["node_243", "pad15/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "depthwise_7", "op": "DepthwiseConv2dNative", "input": ["pad15", "node_244_df"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}}}, {"name": "node_244_add", "op": "Add", "input": ["depthwise_7", "node_244_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_246", "op": "Relu", "input": ["node_244_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_247", "op": "Conv2D", "input": ["node_246", "node_247_weight"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}}}, {"name": "node_247_add", "op": "Add", "input": ["node_247", "node_247_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_249", "op": "Relu", "input": ["node_247_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "depthwise_8", "op": "DepthwiseConv2dNative", "input": ["node_249", "node_250_df"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}}}, {"name": "node_250_add", "op": "Add", "input": ["depthwise_8", "node_250_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_252", "op": "Relu", "input": ["node_250_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_253", "op": "Conv2D", "input": ["node_252", "node_253_weight"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "node_253_add", "op": "Add", "input": ["node_253", "node_253_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_255", "op": "Relu", "input": ["node_253_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "depthwise_9", "op": "DepthwiseConv2dNative", "input": ["node_255", "node_256_df"], "attr": {"padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "node_256_add", "op": "Add", "input": ["depthwise_9", "node_256_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_258", "op": "Relu", "input": ["node_256_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_259", "op": "Conv2D", "input": ["node_258", "node_259_weight"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "node_259_add", "op": "Add", "input": ["node_259", "node_259_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_261", "op": "Relu", "input": ["node_259_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "depthwise_10", "op": "DepthwiseConv2dNative", "input": ["node_261", "node_280_df"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "depthwise_12", "op": "DepthwiseConv2dNative", "input": ["node_261", "node_283_df"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "pad21", "op": "Pad", "input": ["node_261", "pad21/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "node_280_add", "op": "Add", "input": ["depthwise_10", "node_280_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_283_add", "op": "Add", "input": ["depthwise_12", "node_283_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "depthwise_11", "op": "DepthwiseConv2dNative", "input": ["pad21", "node_262_df"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "node_281", "op": "Relu", "input": ["node_280_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_284", "op": "Relu", "input": ["node_283_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_262_add", "op": "Add", "input": ["depthwise_11", "node_262_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_regression_stride_16", "op": "Conv2D", "input": ["node_281", "node_regression_stride_16_weight"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}}}, {"name": "node_285", "op": "Conv2D", "input": ["node_284", "node_285_weight"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "node_264", "op": "Relu", "input": ["node_262_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_regression_stride_16_add", "op": "Add", "input": ["node_regression_stride_16", "node_regression_stride_16_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_285_add", "op": "Add", "input": ["node_285", "node_285_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_265", "op": "Conv2D", "input": ["node_264", "node_265_weight"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "s16_reshape", "op": "Reshape", "input": ["node_285_add", "s16_shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "node_265_add", "op": "Add", "input": ["node_265", "node_265_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "s16_softmax", "op": "Softmax", "input": ["s16_reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_267", "op": "Relu", "input": ["node_265_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "depthwise_13", "op": "DepthwiseConv2dNative", "input": ["node_267", "node_268_df"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "node_268_add", "op": "Add", "input": ["depthwise_13", "node_268_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_270", "op": "Relu", "input": ["node_268_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_271", "op": "Conv2D", "input": ["node_270", "node_271_weight"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "node_271_add", "op": "Add", "input": ["node_271", "node_271_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_273", "op": "Relu", "input": ["node_271_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "depthwise_14", "op": "DepthwiseConv2dNative", "input": ["node_273", "node_287_df"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "depthwise_15", "op": "DepthwiseConv2dNative", "input": ["node_273", "node_290_df"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "node_274", "op": "Conv2D", "input": ["node_273", "node_274_weight"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "node_287_add", "op": "Add", "input": ["depthwise_14", "node_287_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_290_add", "op": "Add", "input": ["depthwise_15", "node_290_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_274_add", "op": "Add", "input": ["node_274", "node_274_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_288", "op": "Relu", "input": ["node_287_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_291", "op": "Relu", "input": ["node_290_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_275", "op": "Relu", "input": ["node_274_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_regression_stride_32", "op": "Conv2D", "input": ["node_288", "node_regression_stride_32_weight"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "node_292", "op": "Conv2D", "input": ["node_291", "node_292_weight"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "pad26", "op": "Pad", "input": ["node_275", "pad26/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "node_regression_stride_32_add", "op": "Add", "input": ["node_regression_stride_32", "node_regression_stride_32_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_292_add", "op": "Add", "input": ["node_292", "node_292_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "depthwise_16", "op": "DepthwiseConv2dNative", "input": ["pad26", "node_276_df"], "attr": {"data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "s32_reshape", "op": "Reshape", "input": ["node_292_add", "s32_shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "node_276_add", "op": "Add", "input": ["depthwise_16", "node_276_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "s32_softmax", "op": "Softmax", "input": ["s32_reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_277", "op": "Relu", "input": ["node_276_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_278", "op": "Conv2D", "input": ["node_277", "node_278_weight"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "node_278_add", "op": "Add", "input": ["node_278", "node_278_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_279", "op": "Relu", "input": ["node_278_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_regression_stride_64", "op": "Conv2D", "input": ["node_279", "node_regression_stride_64_weight"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "node_295", "op": "Conv2D", "input": ["node_279", "node_295_weight"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "node_regression_stride_64_add", "op": "Add", "input": ["node_regression_stride_64", "node_regression_stride_64_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "node_295_add", "op": "Add", "input": ["node_295", "node_295_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "s64_reshape", "op": "Reshape", "input": ["node_295_add", "s64_shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "s64_softmax", "op": "Softmax", "input": ["s64_reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {}}, "weightsManifest": [{"paths": ["group1-shard1of1.fmin"], "weights": [{"name": "node_280_df", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "node_280_bias", "shape": [128], "dtype": "float32"}, {"name": "node_regression_stride_16_weight", "shape": [1, 1, 128, 8], "dtype": "float32"}, {"name": "node_regression_stride_16_bias", "shape": [8], "dtype": "float32"}, {"name": "node_287_df", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "node_287_bias", "shape": [256], "dtype": "float32"}, {"name": "node_regression_stride_32_weight", "shape": [1, 1, 256, 8], "dtype": "float32"}, {"name": "node_regression_stride_32_bias", "shape": [8], "dtype": "float32"}, {"name": "node_regression_stride_64_weight", "shape": [3, 3, 256, 24], "dtype": "float32"}, {"name": "node_regression_stride_64_bias", "shape": [24], "dtype": "float32"}, {"name": "node_283_df", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "node_283_bias", "shape": [128], "dtype": "float32"}, {"name": "node_285_weight", "shape": [1, 1, 128, 4], "dtype": "float32"}, {"name": "node_285_bias", "shape": [4], "dtype": "float32"}, {"name": "s16_shape", "shape": [2], "dtype": "int32"}, {"name": "node_290_df", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "node_290_bias", "shape": [256], "dtype": "float32"}, {"name": "node_292_weight", "shape": [1, 1, 256, 4], "dtype": "float32"}, {"name": "node_292_bias", "shape": [4], "dtype": "float32"}, {"name": "s32_shape", "shape": [2], "dtype": "int32"}, {"name": "mean_value", "shape": [3], "dtype": "float32"}, {"name": "pad0/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "node_199_weight", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "node_199_bias", "shape": [16], "dtype": "float32"}, {"name": "node_202_df", "shape": [3, 3, 16, 1], "dtype": "float32"}, {"name": "node_202_bias", "shape": [16], "dtype": "float32"}, {"name": "node_205_weight", "shape": [1, 1, 16, 32], "dtype": "float32"}, {"name": "node_205_bias", "shape": [32], "dtype": "float32"}, {"name": "pad3/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "node_208_df", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "node_208_bias", "shape": [32], "dtype": "float32"}, {"name": "node_211_weight", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "node_211_bias", "shape": [32], "dtype": "float32"}, {"name": "node_214_df", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "node_214_bias", "shape": [32], "dtype": "float32"}, {"name": "node_217_weight", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "node_217_bias", "shape": [32], "dtype": "float32"}, {"name": "pad7/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "node_220_df", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "node_220_bias", "shape": [32], "dtype": "float32"}, {"name": "node_223_weight", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "node_223_bias", "shape": [64], "dtype": "float32"}, {"name": "node_226_df", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "node_226_bias", "shape": [64], "dtype": "float32"}, {"name": "node_229_weight", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "node_229_bias", "shape": [64], "dtype": "float32"}, {"name": "node_232_df", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "node_232_bias", "shape": [64], "dtype": "float32"}, {"name": "node_235_weight", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "node_235_bias", "shape": [64], "dtype": "float32"}, {"name": "node_238_df", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "node_238_bias", "shape": [64], "dtype": "float32"}, {"name": "node_241_weight", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "node_241_bias", "shape": [64], "dtype": "float32"}, {"name": "pad15/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "node_244_df", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "node_244_bias", "shape": [64], "dtype": "float32"}, {"name": "node_247_weight", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "node_247_bias", "shape": [128], "dtype": "float32"}, {"name": "node_250_df", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "node_250_bias", "shape": [128], "dtype": "float32"}, {"name": "node_253_weight", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "node_253_bias", "shape": [128], "dtype": "float32"}, {"name": "node_256_df", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "node_256_bias", "shape": [128], "dtype": "float32"}, {"name": "node_259_weight", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "node_259_bias", "shape": [128], "dtype": "float32"}, {"name": "pad21/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "node_262_df", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "node_262_bias", "shape": [128], "dtype": "float32"}, {"name": "node_265_weight", "shape": [1, 1, 128, 256], "dtype": "float32"}, {"name": "node_265_bias", "shape": [256], "dtype": "float32"}, {"name": "node_268_df", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "node_268_bias", "shape": [256], "dtype": "float32"}, {"name": "node_271_weight", "shape": [1, 1, 256, 256], "dtype": "float32"}, {"name": "node_271_bias", "shape": [256], "dtype": "float32"}, {"name": "node_274_weight", "shape": [1, 1, 256, 64], "dtype": "float32"}, {"name": "node_274_bias", "shape": [64], "dtype": "float32"}, {"name": "pad26/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "node_276_df", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "node_276_bias", "shape": [64], "dtype": "float32"}, {"name": "node_278_weight", "shape": [1, 1, 64, 256], "dtype": "float32"}, {"name": "node_278_bias", "shape": [256], "dtype": "float32"}, {"name": "node_295_weight", "shape": [3, 3, 256, 12], "dtype": "float32"}, {"name": "node_295_bias", "shape": [12], "dtype": "float32"}, {"name": "s64_shape", "shape": [2], "dtype": "int32"}]}]}